## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 10 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                  NAME                                                   |
|--------|---------------------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.notification-canada-ca-alt[0]`                                          |
|        | `aws_acm_certificate_validation.notification-canada-ca[0]`                                              |
|        | `aws_route53_record.notification-canada-ca-alt[0]`                                                      |
|        | `aws_route53_record.notification-canada-ca[0]`                                                          |
| delete | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.notification.alpha.cdssandbox.xyz&quot;]`      |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.notification.alpha.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.notification.alpha.cdssandbox.xyz&quot;]`          |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.notification.alpha.cdssandbox.xyz&quot;]`        |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;staging.notification.alpha.cdssandbox.xyz&quot;]`            |
|        | `aws_route53_record.notification-canada-ca[&quot;*.api.staging.notification.cdssandbox.xyz&quot;]`                |
|        | `aws_route53_record.notification-canada-ca[&quot;*.document.staging.notification.cdssandbox.xyz&quot;]`           |
|        | `aws_route53_record.notification-canada-ca[&quot;*.staging.notification.cdssandbox.xyz&quot;]`                    |
|        | `aws_route53_record.notification-canada-ca[&quot;api.staging.notification.cdssandbox.xyz&quot;]`                  |
|        | `aws_route53_record.notification-canada-ca[&quot;staging.notification.cdssandbox.xyz&quot;]`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/db0b2d43-d054-4c2f-b991-a946f665b445"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.notification-canada-ca[0] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.api.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["*.document.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_aa51db2fea1aaaa2486be78695309fd4.wggjkglgrm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["*.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["api.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["staging.notification.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_3b9faf7a03aadc824ded19cf529bf3dd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["staging.notification.alpha.cdssandbox.xyz"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

Plan: 4 to add, 0 to change, 10 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-beat-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main...
```

</details>
